{
  "metadata": {
    "direction": "ltr",
    "language": "es"
  },
  "app": {
    "tagline": "Primero móvil • Accesible • Bilingüe",
    "title": "Planificador ABLE (andamiaje)"
  },
  "ui": {
    "sidebar": {
      "disclosures": "Supuestos",
      "inputs": "Entradas",
      "reports": "Informes",
      "resources": "Recursos",
      "schedule": "Amortización"
    },
    "assumptions": {
      "title": "Supuestos",
      "items": [
        "Este planificador es solo para la planificación de ahorro en cuentas ABLE y no proporciona asesoramiento legal, fiscal, de inversión ni financiero.",
        "Los resultados son proyecciones determinísticas basadas por completo en los datos ingresados por el usuario y en reglas configuradas; no son predicciones del desempeño real futuro.",
        "El rendimiento de inversión se modela como una tasa anual constante convertida a una tasa mensual constante para fines de proyección.",
        "Las contribuciones y los retiros se modelan como flujos de efectivo mensuales recurrentes según los valores ingresados por el usuario.",
        "El período de contribuciones termina en la fecha de fin de contribución seleccionada, o antes si aplican reglas automáticas de detención por límites de saldo máximo del plan o límites de SSI, cuando corresponda.",
        "El período de retiros comienza en la fecha de inicio de retiro seleccionada.",
        "Los porcentajes de aumento de contribución y de retiro se aplican en intervalos anuales.",
        "Cuando los aumentos de contribución excederían los límites anuales, esos aumentos se detienen según la lógica de límites del planificador.",
        "ABLE to Work, si corresponde, se modela con el ingreso laboral ingresado y restricciones configuradas del nivel de pobreza para determinar el aporte adicional permitido.",
        "Si ABLE to Work no se usa o no es elegible, la lógica del planificador aplica los límites anuales base de contribución.",
        "El Crédito Federal del Ahorrador se estima con el ingreso imponible y el estado civil para impuestos mediante los tramos federales más recientes y reglas de límites federales.",
        "Las estimaciones de beneficios fiscales estatales, deducción o crédito, se basan en reglas estatales vigentes y lógica de estado civil para impuestos.",
        "Cuando corresponde según las reglas configuradas, los beneficios fiscales se limitan por la obligación tributaria estimada.",
        "El impacto fiscal federal y estatal de la cuenta gravable se estima con tasas y reglas configuradas y se aplica en el modelo de proyección gravable.",
        "El impacto fiscal de la cuenta gravable se muestra como efecto negativo en las salidas de comparación.",
        "Las comparaciones entre cuentas ABLE y gravables asumen los mismos flujos de efectivo ingresados por el usuario, salvo que restricciones de reglas modifiquen el comportamiento de la cuenta ABLE.",
        "Si la elegibilidad de SSI está habilitada, el planificador aplica el comportamiento de límite de saldo SSI, incluyendo la detención de contribuciones y retiros requeridos según el modelo.",
        "Si se alcanza una restricción de saldo máximo de la cuenta del plan, la lógica del planificador detiene las contribuciones según reglas configuradas.",
        "Si los retiros solicitados exceden los fondos disponibles, los retiros se limitan al saldo disponible y no se permiten saldos negativos.",
        "El horizonte de proyección está limitado por el máximo de años permitido en la configuración del cliente o estado seleccionado.",
        "Los controles de Ventana de reporte filtran el rango mostrado dentro del cronograma completo calculado.",
        "La visualización del gráfico termina en el primer mes en que el saldo final proyectado llega a cero, cuando corresponda.",
        "Ciertos componentes de gráficos usan suavizado o distribución para facilitar la lectura visual; los valores detallados del cronograma mensual siguen siendo la referencia para resultados exactos por mes.",
        "Los valores monetarios se redondean y formatean para su visualización; pueden existir diferencias visuales menores frente a la precisión interna del cálculo.",
        "Las salidas dependen del idioma y la configuración del cliente seleccionados, incluidas etiquetas, disponibilidad y orden de pestañas y comportamientos de presentación.",
        "Las reglas de programas estatales y federales pueden cambiar con el tiempo; este planificador refleja solo el conjunto de reglas y configuraciones cargado actualmente.",
        "Las decisiones de elegibilidad y cumplimiento deben confirmarse con profesionales calificados y con la guía oficial del programa ABLE antes de actuar."
      ]
    },
    "resources": {
      "title": "Recursos",
      "intro": "Esta sección resume temas clave sobre ABLE e impuestos y le dirige a fuentes primarias para validación.",
      "sections": [
        {
          "title": "Reglas de SSI, límites y riesgos comunes",
          "paragraphs": [
            "SSI se basa en necesidad económica. Los saldos ABLE hasta $100,000 generalmente se excluyen del conteo de recursos de SSI, pero montos por encima de ese umbral pueden afectar el beneficio en efectivo de SSI.",
            "Riesgos frecuentes incluyen confundir el tratamiento de recursos, no monitorear cómo la actividad de la cuenta impacta elegibilidad y mezclar reglas de SSI con reglas de Medicaid."
          ],
          "links": [
            {
              "label": "SSA SSI Spotlight on ABLE Accounts",
              "url": "https://www.ssa.gov/ssi/spotlights/spot-able.html"
            },
            {
              "label": "SSA POMS SI 01130.740 (ABLE Accounts)",
              "url": "https://secure.ssa.gov/apps10/poms.nsf/lnx/0501130740"
            },
            {
              "label": "SSA Red Book (Work and Disability Policy Reference)",
              "url": "https://www.ssa.gov/redbook/"
            },
            {
              "label": "IRS Newsroom: ABLE Accounts Overview",
              "url": "https://www.irs.gov/newsroom/able-accounts-a-valuable-financial-solution-for-people-with-disabilities"
            },
            {
              "label": "IRS FSLG: ABLE Accounts Tax Benefit",
              "url": "https://www.irs.gov/government-entities/federal-state-local-governments/able-accounts-tax-benefit-for-people-with-disabilities"
            }
          ]
        },
        {
          "title": "Crédito Federal del Ahorrador",
          "paragraphs": [
            "El Crédito Federal del Ahorrador es un crédito no reembolsable. La elegibilidad y el porcentaje dependen del ingreso imponible y del estado civil para impuestos.",
            "Al ser no reembolsable, el crédito está limitado por su obligación tributaria federal."
          ],
          "links": [
            {
              "label": "IRS Saver’s Credit Guidance",
              "url": "https://www.irs.gov/retirement-plans/plan-participant-employee/retirement-savings-contributions-savers-credit"
            },
            {
              "label": "IRS Form 8880 (Credit for Qualified Retirement Savings Contributions)",
              "url": "https://www.irs.gov/forms-pubs/about-form-8880"
            }
          ]
        },
        {
          "title": "Reglas de ABLE to Work",
          "paragraphs": [
            "ABLE to Work puede permitir contribuciones adicionales por encima del límite anual base si se cumplen condiciones específicas de elegibilidad.",
            "Los límites y la elegibilidad dependen de reglas federales y pueden interactuar con sus ingresos laborales y cobertura de plan de retiro."
          ],
          "links": [
            {
              "label": "IRS Publication 907 (Tax Highlights for Persons With Disabilities)",
              "url": "https://www.irs.gov/publications/p907"
            },
            {
              "label": "ABLE National Resource Center",
              "url": "https://www.ablenrc.org/"
            }
          ]
        },
        {
          "title": "Límites anuales de contribución y tope de saldo del plan",
          "paragraphs": [
            "Los límites anuales de contribución se establecen bajo reglas fiscales federales y pueden cambiar cada año.",
            "Los topes de saldo máximo son específicos de cada programa estatal ABLE y pueden variar entre estados."
          ],
          "links": [
            {
              "label": "IRS ABLE Accounts Overview",
              "url": "https://www.irs.gov/publications/p907"
            },
            {
              "label": "ABLE NRC State Program Finder",
              "url": "https://www.ablenrc.org/select-a-state-program/"
            }
          ]
        },
        {
          "title": "Recursos adicionales",
          "paragraphs": [
            "Contenido y enlaces por definir."
          ],
          "links": [
            {
              "label": "MSRB Investors’ Guide for ABLE Programs (PDF)",
              "url": "https://www.msrb.org/sites/default/files/Investors-Guide-for-ABLE-Programs.pdf"
            }
          ]
        }
      ]
    },
    "inputs": {
      "accountActivity": {
        "startingBalanceLabel": "Saldo inicial",
        "title": "Actividad de la cuenta"
      },
      "demographics": {
        "title": "Información demográfica"
      }
    }
  },
  "buttons": {
    "back": "Atrás",
    "cancel": "Cancelar",
    "changeResidencyProceed": "Cambiar mi residencia y continuar al calculador",
    "continue": "Continuar",
    "done": "Listo",
    "eligibleRetest": "Elegible — Reintentar",
    "eligibleToEvaluate": "Elegible para evaluar",
    "enterAgiToTestEligibility": "Ingrese el ingreso imponible para probar la elegibilidad",
    "evaluate": "Evaluar",
    "next": "Siguiente",
    "no": "No",
    "notEligibleBasedOnAgi": "No elegible según el ingreso imponible",
    "notEligibleRetest": "No elegible — Reintentar",
    "refresh": "Actualizar",
    "understandProceed": "Entiendo y deseo continuar",
    "welcomeContinue": "Entiendo — Continuar",
    "yes": "Sí"
  },
  "labels": {
    "reports": {
      "title": "Resumen",
      "accountGrowthTab": "Crecimiento de la cuenta",
      "taxBenefitsTab": "Crecimiento ABLE",
      "taxableGrowthTab": "Crecimiento gravable",
      "ableVsTaxableTab": "ABLE vs Gravable",
      "experimentalComparisonTab": "Comparación",
      "reportWindowLabel": "Ventana de reporte",
      "ableVsTaxableTitle": "ABLE vs gravable",
      "ableVsTaxableMetricLabel": "Componente",
      "ableVsTaxableAbleLabel": "ABLE",
      "ableVsTaxableTaxableLabel": "Gravable",
      "ableVsTaxableNaLabel": "—",
      "ableVsTaxableRows": {
        "startingBalance": "Saldo inicial",
        "contributions": "Contribuciones",
        "withdrawals": "Retiros",
        "investmentReturns": "Rendimientos de inversión",
        "federalTaxes": "Impuestos federales sobre rendimientos",
        "stateTaxes": "Impuestos estatales sobre rendimientos",
        "endingBalance": "Saldo final",
        "federalSaversCredit": "Crédito Federal del Ahorrista",
        "stateTaxBenefits": "Beneficios fiscales estatales sobre contribuciones",
        "totalEconomicValue": "Valor económico total",
        "totalEconomicBenefit": "Beneficio económico total"
      },
      "experimentalComparisonTitle": "Comparación ABLE vs gravable",
      "experimentalComparisonPanelTitle": "Diferencias clave",
      "experimentalComparisonAbleLine": "Cuenta ABLE",
      "experimentalComparisonTaxableLine": "Cuenta gravable",
      "experimentalComparisonWithdrawalDifference": "Durante el período, la cuenta ABLE proporciona {{amount}} más en retiros que la cuenta gravable.",
      "experimentalComparisonTaxableWithdrawalDifference": "Durante el período, la cuenta gravable proporciona {{amount}} más en retiros que la cuenta ABLE.",
      "experimentalComparisonWithdrawalInfoToggleAria": "Mostrar explicación de retiros",
      "experimentalComparisonWithdrawalInfoMessage": "La cuenta gravable se agota por completo durante el período, mientras que la cuenta ABLE mantiene un saldo positivo por más tiempo y, por lo tanto, permite retiros más altos que la cuenta gravable.",
      "experimentalComparisonAbleBalanceAdvantage": "Al final del período, la cuenta ABLE tiene {{amount}} más que la cuenta gravable.",
      "experimentalComparisonTaxableBalanceAdvantage": "Al final del período, la cuenta gravable tiene {{amount}} más que la cuenta ABLE.",
      "experimentalComparisonBalanceInfoToggleAria": "Mostrar explicación del saldo",
      "experimentalComparisonBalanceInfoMessage": "Principalmente debido a impuestos por {{taxes}} que se pagarían con los rendimientos de la cuenta gravable y que se evitan en la cuenta ABLE. Además, la cuenta gravable tiene {{returns}} menos en rendimientos de inversión debido a saldos invertidos más bajos en general por el impacto fiscal.",
      "experimentalComparisonAdditionalEconomicBenefitBoth": "Durante el período, la cuenta ABLE genera beneficios económicos adicionales de {{amount}} debido al Crédito Federal del Ahorrista y a los beneficios fiscales estatales sobre contribuciones.",
      "experimentalComparisonAdditionalEconomicBenefitFederalOnly": "Durante el período, la cuenta ABLE genera beneficios económicos adicionales de {{amount}} debido al Crédito Federal del Ahorrista.",
      "experimentalComparisonAdditionalEconomicBenefitStateOnly": "Durante el período, la cuenta ABLE genera beneficios económicos adicionales de {{amount}} debido a los beneficios fiscales estatales sobre contribuciones.",
      "experimentalComparisonAdditionalEconomicBenefitNone": "Durante el período, la cuenta ABLE no genera beneficios económicos adicionales del Crédito Federal del Ahorrista ni de los beneficios fiscales estatales sobre contribuciones.",
      "experimentalComparisonAdditionalEconomicBenefitInfoToggleAria": "Mostrar explicación de beneficios económicos adicionales",
      "experimentalComparisonAdditionalEconomicBenefitInfoMessage": "Estos montos representan beneficios económicos adicionales y no están incluidos en el saldo de la cuenta ABLE ni en los rendimientos de inversión.",
      "experimentalComparisonInvestmentReturnDifference": "Durante el período, los rendimientos de inversión de la cuenta ABLE son {{amount}} más que los de la cuenta gravable.",
      "experimentalComparisonTaxableInvestmentReturnDifference": "Durante el período, los rendimientos de inversión de la cuenta gravable son {{amount}} más que los de la cuenta ABLE.",
      "experimentalComparisonInvestmentReturnInfoToggleAria": "Mostrar explicación de rendimientos de inversión",
      "experimentalComparisonInvestmentReturnInfoMessageWithState": "Principalmente debido a saldos invertidos más bajos en la cuenta gravable, reducidos en {{amount}} por impuestos federales y estatales durante el período.",
      "experimentalComparisonInvestmentReturnInfoMessageFederalOnly": "Principalmente debido a saldos invertidos más bajos en la cuenta gravable, reducidos en {{amount}} por impuestos federales durante el período.",
      "experimentalComparisonNoDifferences": "No hay diferencias adicionales en esta ventana de reporte."
    },
    "inputs": {
      "accountActivityTitle": "Actividad de la cuenta",
      "agiLabel": "Ingreso imponible",
      "agiCallout": "El ingreso imponible ayuda a determinar los beneficios fiscales federales y, cuando corresponda, estatales proyectados.",
      "annualReturnLabel": "Suposición de rendimiento anual de la inversión (%)",
      "annualReturnCallout": "Este es el rendimiento anual de inversión supuesto que se usa en las proyecciones. Puede cambiarlo para explorar diferentes escenarios.",
      "checkEligibility": "Verificar elegibilidad",
      "agiRequiredInlineLabel": "Campo obligatorio",
      "agiRequiredFootnote": "* Ingrese $0 si no tiene ingresos.",
      "agiRequiredFieldPlaceholder": "Campo obligatorio. Ingrese $0 si no tiene.",
      "requiredFieldPlaceholder": "Campo obligatorio",
      "contributionEndLabel": "Fin de contribución",
      "contributionEndCallout": "Seleccione el mes y el año en que deben finalizar las contribuciones recurrentes. Si se deja en blanco, las contribuciones continúan hasta el horizonte temporal seleccionado.",
      "contributionIncreaseLabel": "Aumento anual de contribución (%)",
      "contributionIncreaseCallout": "Use este campo para modelar aumentos anuales en las contribuciones recurrentes. El planificador puede limitar aumentos automáticamente cuando se superen límites de contribución.",
      "contributionIncreaseDisabledHelper": "Las contribuciones base ya alcanzan el límite anual; los aumentos están deshabilitados.",
      "contributionIncreaseBreachHelper": "Con {{pct}}%, las contribuciones exceden el límite anual en el año {{breachYear}}. Los aumentos de contribución se detendrán después del año {{stopYear}}.",
      "demographicsTitle": "Información demográfica",
      "eligibleToEvaluate": "Elegible para evaluar",
      "filing": {
        "head_of_household": "Cabeza de familia",
        "married_joint": "Casado presentando en conjunto",
        "married_separate": "Casado declarando por separado",
        "single": "Soltero"
      },
      "filingStatusLabel": "Estado civil para impuestos",
      "filingStatusCallout": "Su estado civil para impuestos ayuda a determinar los beneficios fiscales federales y, cuando corresponda, estatales proyectados.",
      "fscAge18": "¿Tiene 18 años o más?",
      "fscEligibilityTitle": "Elegibilidad para el Crédito del Ahorrista Federal",
      "fscEligibleLabel": "Elegible para evaluar",
      "fscHeading": "Elegibilidad para el Crédito Federal del Ahorrista",
      "fscHeadingCallout": "El Crédito Federal del Ahorrista es un crédito fiscal no reembolsable que puede reducir su impuesto federal sobre la renta si realiza contribuciones elegibles a cuentas de jubilación o ABLE y cumple con los límites de ingresos. El porcentaje del crédito depende de su ingreso bruto ajustado (AGI) y estado civil para impuestos, y no puede exceder su obligación tributaria federal total.",
      "fscIntro": "Responda estas preguntas para estimar su elegibilidad.",
      "fscTaxLiability": "¿Tiene obligación de pagar impuestos federales sobre la renta?",
      "monthlyContributionLabel": "Contribución mensual",
      "monthlyContributionCallout": "Ingrese el monto de la contribución mensual recurrente. Las contribuciones se modelan como flujos recurrentes y pueden limitarse por reglas del plan ABLE en la proyección.",
      "monthlyWithdrawalLabel": "Retiro mensual",
      "monthlyWithdrawalCallout": "Ingrese el monto del retiro mensual recurrente. En la comparación imponible, los retiros siguen el mismo patrón salvo que la cuenta imponible se agote antes.",
      "monthPlaceholder": "Mes",
      "nameLabel": "Nombre del beneficiario",
      "nameCallout": "El beneficiario es la persona que es titular de la cuenta ABLE y para quien están destinados los fondos. Las contribuciones, los retiros y las reglas de elegibilidad se aplican a esta persona.",
      "plannerConsoleTitle": "CONSOLA DEL PLANIFICADOR",
      "selectState": "Seleccione un estado",
      "ssiEligibilityLabel": "El beneficiario es elegible para SSI",
      "ssiEligibilityCallout": "El Ingreso Suplementario de Seguridad (SSI) es un programa federal basado en necesidades que proporciona asistencia mensual en efectivo a personas con discapacidades y con ingresos y recursos limitados. Los saldos de la cuenta ABLE de hasta $100,000 están excluidos del límite de recursos de SSI, pero los montos por encima de ese umbral pueden afectar la elegibilidad.",
      "ssiEligibleLabel": "El beneficiario es elegible para SSI",
      "startingBalanceLabel": "Saldo inicial",
      "startingBalanceCallout": "El saldo inicial debe reflejar un saldo existente de cuenta ABLE y/o una transferencia calificada utilizada para iniciar esta proyección.",
      "stateOfResidenceLabel": "Estado de residencia",
      "stateOfResidenceCallout": "Su estado de residencia se utiliza para determinar la elegibilidad del plan y ciertos beneficios fiscales estatales.",
      "timeHorizonYearsFallback": "Horizonte de tiempo (años)",
      "timeHorizonCallout": "Elija cuánto tiempo desea planificar. El horizonte seleccionado determina hasta cuándo corren las proyecciones y dónde terminan los cronogramas de contribuciones o retiros.",
      "withdrawalIncreaseLabel": "Aumento anual de retiro (%)",
      "withdrawalIncreaseCallout": "Use este campo para modelar aumentos anuales en los retiros recurrentes con el tiempo.",
      "withdrawalStartLabel": "Inicio del retiro",
      "withdrawalStartCallout": "Seleccione el mes y el año en que deben comenzar los retiros recurrentes. Si se deja en blanco, los retiros comienzan al inicio de la proyección.",
      "qualifiedWithdrawalsBudgetButtonLabel": "Presupuesto para retiros calificados",
      "qualifiedWithdrawalsBudgetTitle": "Presupuesto para retiros calificados",
      "qualifiedWithdrawalsHousing": "Vivienda",
      "qualifiedWithdrawalsHealthcare": "Salud",
      "qualifiedWithdrawalsTransportation": "Transporte",
      "qualifiedWithdrawalsEducation": "Educación",
      "qualifiedWithdrawalsOther": "Otro",
      "qualifiedWithdrawalsTotal": "Total",
      "wtaEarnedIncomeInput": "Por favor ingrese el ingreso estimado del trabajo:",
      "wtaEarnedIncomeQuestion": "¿El beneficiario tiene ingresos del trabajo?",
      "wtaRetirementPlanQuestion": "¿El beneficiario está cubierto por un plan de jubilación?",
      "yearPlaceholder": "Año"
    },
    "schedule": {
      "ableAccountToggle": "Cuenta ABLE",
      "accountBalance": "Saldo",
      "accountTotals": "Totales de la cuenta",
      "amortizationTitle": "Cronograma de amortización",
      "contributions": "Contribuciones",
      "downloadAbleCsvAria": "Descargar CSV de cuenta ABLE",
      "downloadCsvTitle": "Descargar CSV",
      "downloadTaxableCsvAria": "Descargar CSV de cuenta imponible",
      "enterTimeHorizonPrompt": "Ingrese un horizonte temporal para ver el cronograma.",
      "federalSaversCredit": "Crédito federal del ahorrador",
      "federalTaxes": "Impuestos federales",
      "investmentReturns": "Rendimientos",
      "monthYear": "Mes/Año",
      "scheduleTitle": "Cronograma",
      "stateTaxBenefit": "Beneficio fiscal estatal",
      "stateTaxes": "Impuestos estatales",
      "taxableAccountToggle": "Cuenta imponible",
      "withdrawals": "Retiros"
    },
    "fsc": {
      "age18": "¿Tiene 18 años o más?",
      "dependent": "¿Alguien puede declararle como dependiente?",
      "intro": "Responda estas preguntas para estimar la elegibilidad.",
      "student": "¿Es estudiante de tiempo completo?",
      "taxLiability": "¿Tiene obligación de pagar impuestos federales sobre la renta?"
    },
    "disclosures": "Divulgaciones",
    "ui": {
      "externalLinkWarningTitle": "Aviso de enlace externo",
      "placeholderComingSoon": "El contenido de marcador de posición estará disponible pronto.",
      "shellSuffix": " (Borrador)"
    },
    "highReturnWarning": "Esa suposición de rendimiento es inusualmente alta. Considere ≤ {{max}}%.",
    "residencyGeneralAdvice": "Debe verificar si su estado de residencia ofrece un plan ABLE, lo cual puede proporcionar ciertos beneficios fiscales estatales.",
    "residencyNotAllowed": "El beneficiario no es elegible para abrir una cuenta {{plan}} porque el plan {{plan}} requiere que el beneficiario sea residente de {{state}}.",
    "wtaEarnedIncomeInput": "Por favor ingrese el ingreso del trabajo estimado:",
    "wtaEarnedIncomeQuestion": "¿Tiene el beneficiario ingresos del trabajo?",
    "wtaRetirementPlanQuestion": "¿Está el beneficiario cubierto por un plan de jubilación?"
  },
  "messages": {
    "ableDepletionNotice": "Según sus supuestos, el saldo de la cuenta ABLE llega a cero en {{reachMonthYear}}. En consecuencia, los retiros se detienen en este planificador después de {{stopMonthYear}}.",
    "ableDepletionNoticeLimitedWithdrawals": "Según sus supuestos, el saldo de la cuenta ABLE llega a cero en {{reachMonthYear}}. Después de {{reachMonthYear}}, los retiros se limitan cada mes al monto disponible en la cuenta.",
    "accountEndingValueLabel": "VALOR FINAL DE LA CUENTA",
    "externalLinkWarning": "NOTA: Está a punto de salir de ABLE Planner y ver el contenido de un sitio web externo. No podemos hacernos responsables del contenido de sitios web externos. No respaldamos el sitio externo, sus patrocinadores ni ninguna de sus políticas o servicios ofrecidos en el sitio o por cualquier anunciante en el sitio.",
    "balanceCapWarning": "Según sus contribuciones, retiros y supuestos de rendimiento, se proyecta que la cuenta supere {{cap}} en {{breach}}.\n\nEsto puede resultar en la suspensión de los beneficios de SSI y tener un impacto financiero adverso.\n\nEn consecuencia, en esta herramienta de planificación, las contribuciones se detienen en {{stop}}. También se inician retiros recurrentes en {{withdrawStart}} para mantener el saldo en {{cap}} retirando las ganancias mensuales proyectadas.",
    "balanceCapWarningExistingWithdrawals": "Según sus contribuciones, retiros y supuestos de rendimiento, se proyecta que la cuenta supere {{cap}} en {{breach}}.\n\nEsto puede resultar en la suspensión de los beneficios de SSI y tener un impacto financiero adverso.\n\nEn consecuencia, en esta herramienta de planificación, las contribuciones se detienen en {{stop}}. También se revisan los retiros recurrentes en {{withdrawStart}} para mantener el saldo en {{cap}} retirando las ganancias mensuales proyectadas.",
    "balanceCapWarningWithdrawalsOnly": "Según sus retiros y supuestos de rendimiento, se proyecta que la cuenta supere {{cap}} en {{breach}}.\n\nEsto puede resultar en la suspensión de los beneficios de SSI y tener un impacto financiero adverso.\n\nEn consecuencia, en esta herramienta de planificación, también se inician retiros recurrentes en {{withdrawStart}} para mantener el saldo en {{cap}} retirando las ganancias mensuales proyectadas.",
    "balanceCapWarningWithdrawalsOnlyExisting": "Según sus retiros y supuestos de rendimiento, se proyecta que la cuenta supere {{cap}} en {{breach}}.\n\nEsto puede resultar en la suspensión de los beneficios de SSI y tener un impacto financiero adverso.\n\nEn consecuencia, en esta herramienta de planificación, también se revisan los retiros recurrentes en {{withdrawStart}} para mantener el saldo en {{cap}} retirando las ganancias mensuales proyectadas.",
    "balanceCapWarningNoForcedWithdrawals": "Según sus contribuciones, retiros y supuestos de rendimiento, se proyecta que la cuenta supere {{cap}} en {{breach}}.\n\nEsto puede resultar en la suspensión de los beneficios de SSI y tener un impacto financiero adverso.\n\nEn consecuencia, en esta herramienta de planificación, las contribuciones se detienen en {{stop}}.",
    "ssiIncomeEligibilityWarning": "Según su ingreso imponible y estado civil para impuestos, es posible que no sea elegible para beneficios de SSI. Sin embargo, el planificador ABLE asumirá que el beneficiario es elegible para beneficios de SSI según su selección. En consecuencia, el planificador ABLE implementará lógica para mantener los saldos por debajo del límite de SSI al detener contribuciones y aplicar distribuciones requeridas, cuando sea necesario.",
    "ssiSelectionPlannerMessage": "El Planificador ABLE detendrá las contribuciones e implementará retiros cuando sea necesario para mantener el saldo proyectado de su cuenta por debajo de $100,000.",
    "withdrawalLimitedToAvailable": "El monto de retiro que ingresó excede el monto disponible en su cuenta. En consecuencia, el planificador ABLE limitará sus retiros al monto disponible en su cuenta.",
    "planMaxReached": "En esta herramienta de planificación, las contribuciones se detienen en {{month}} porque el saldo proyectado alcanza el máximo del plan de {{cap}}.",
    "workToAblePrompt": "Sus contribuciones planificadas exceden el límite anual de ABLE de {{cap}}. Si está trabajando, podría calificar para contribuir más (la disposición “ABLE to Work”). ¿Le gustaría saber si califica?",
    "wtaAmountOverCombinedTitle": "MONTO POR ENCIMA DEL LÍMITE COMBINADO:",
    "wtaAmountOverTitle": "MONTO POR ENCIMA DEL LÍMITE ANUAL:",
    "wtaAutoAppliedAdjustedLine": "Ajustamos sus contribuciones planificadas para mantenerlas por debajo del límite anual de contribución.",
    "wtaAutoAppliedMonthlyCapHint": "(Este año: {{current}}/mes hasta diciembre; a partir de enero: {{future}}/mes.)",
    "wtaEarnedIncomeInput": "Por favor ingrese el ingreso estimado del trabajo:",
    "wtaEarnedIncomeQuestion": "¿El beneficiario tiene ingresos del trabajo?",
    "wtaEligibleOverCombinedLine1": "Califica para contribuciones adicionales de {{additional}}, pero sus contribuciones totales exceden el límite combinado de {{combined}}.",
    "wtaEligibleOverCombinedLine2": "Revise sus montos de contribución para que las contribuciones totales queden por debajo del límite combinado.",
    "wtaNotEligible": "No es elegible para contribuciones adicionales a ABLE bajo la disposición ABLE to Work.",
    "wtaRetirementPlanQuestion": "¿El beneficiario está cubierto por un plan de jubilación?",
    "wtaSetToMaxNote": "Reduciremos la contribución recurrente para mantener un total móvil de 12 meses dentro del límite.",
    "wtaSetToMaxQuestion": "¿Le gustaría ajustar las contribuciones al monto máximo permitido?"
  },
  "flows": {
    "screen1": {
      "defaultMessages": [
        "Aqui es donde el planificador ABLE comparte actualizaciones, alertas y orientacion basadas en sus entradas, y puede solicitar informacion adicional.",
        "Use los campos de entrada para proporcionar la informacion solicitada para el planificador ABLE."
      ]
    },
    "screen2": {
      "defaultMessages": [
        "Use los campos de Actividad de la cuenta para definir sus supuestos de planificacion."
      ]
    }
  },
  "home": {
    "heading": "Bienvenido",
    "intro": "Esta es la base limpia para el Planificador ABLE. La interfaz, el texto y la lógica se incorporarán gradualmente.",
    "languageLoaded": "Idioma cargado: {{lang}}"
  },
  "landing": {
    "agreeAndContinueLabel": "Aceptar y continuar",
    "agreeToTermsPrefix": "Acepto los",
    "disclosuresBody": "Esta herramienta tiene fines únicamente informativos y educativos.\nEsta herramienta de planificación ABLE se ofrece exclusivamente con fines informativos y educativos generales. No está diseñada para brindar asesoramiento legal, fiscal, financiero o de inversión, y no debe tomarse como un sustituto del consejo de profesionales calificados.\n\nSin garantía de resultados\nTodas las proyecciones, gráficos e informes generados por esta herramienta son hipotéticos y se basan en supuestos proporcionados por el usuario. Los resultados reales pueden diferir materialmente. No se garantiza que se alcancen los saldos proyectados, los rendimientos de inversión, la elegibilidad para contribuciones o los beneficios fiscales.\n\nPuede perder parte o la totalidad del dinero invertido en una cuenta ABLE.\n\nRiesgo de inversión\nLas cuentas ABLE están sujetas al riesgo de mercado, incluida la posible pérdida del capital. Los rendimientos de la inversión no están garantizados, y el desempeño pasado no indica resultados futuros. Los cambios en las condiciones del mercado, tarifas, gastos y selecciones de inversión pueden afectar significativamente los resultados. No se simulan la volatilidad de mercado, el riesgo de secuencia de rendimientos ni variaciones intranuales de rendimiento.\n\nSupuestos y simplificaciones\nEsta herramienta depende de supuestos simplificados, que pueden incluir tasas de retorno constantes o estimadas, cronogramas regulares de contribuciones y retiros, y un tratamiento simplificado de impuestos y beneficios fiscales. Las reglas reales del programa ABLE, el desempeño de las inversiones y el tratamiento fiscal varían según el estado y pueden cambiar con el tiempo.\n\nLímites de contribución y elegibilidad\nLos límites de contribución anual, la elegibilidad para ABLE to Work, los beneficios federales, los beneficios estatales y el tratamiento fiscal están gobernados por las leyes federales y estatales y las reglas individuales de cada programa ABLE. Esta herramienta no determina elegibilidad ni cumplimiento, y no debe usarse para tomar decisiones finales sobre contribuciones o retiros.\n\nRetiros y gastos calificados\nLos retiros de una cuenta ABLE deben usarse generalmente para gastos calificados relacionados con la discapacidad para evitar consecuencias fiscales adversas. Esta herramienta no evalúa si los retiros planificados cumplen con las reglas aplicables.\n\nNo constituye una oferta ni una recomendación\nNada de lo contenido en esta herramienta constituye una oferta para vender, una solicitud para comprar o una recomendación sobre ningún producto financiero, inversión o valor.\n\nÚselo bajo su propio criterio\nAl utilizar esta herramienta, reconoce que usted es el único responsable de cómo interpreta y usa la información proporcionada. Para obtener orientación específica a su situación, considere consultar a un profesional calificado en finanzas, impuestos o derecho, o al administrador del programa ABLE de su estado.",
    "disclosuresIntro": "Por favor, lea las siguientes divulgaciones y limitaciones importantes antes de usar esta herramienta.",
    "disclosuresTitle": "Divulgaciones y limitaciones importantes",
    "heroBody": "Una cuenta ABLE puede ser una herramienta potente para ahorrar, invertir y pagar gastos relacionados con la discapacidad sin poner en riesgo beneficios públicos esenciales. Esta herramienta de planificación le ayuda a explorar distintos escenarios, comparar resultados y comprender mejor cómo las decisiones de hoy pueden afectar los saldos del futuro. Explore cómo las contribuciones, los retiros, el crecimiento de las inversiones y los límites del programa pueden interactuar con el tiempo.",
    "heroBullets": [
      "Explorar el crecimiento a largo plazo de ABLE con distintos supuestos",
      "Entender límites de contribución y reglas de elegibilidad",
      "Modelar retiros junto con contribuciones",
      "Revisar saldos proyectados, resúmenes y gráficos en el tiempo"
    ],
    "heroSubtitle": "Explore cómo las contribuciones, los retiros, el crecimiento de las inversiones y los límites del programa pueden interactuar con el tiempo.",
    "heroTitle": "Bienvenido al Planificador ABLE",
    "termsOfUseBody": "Términos de Uso de Spectra Professional Services, LLC.\nEstos Términos de Uso (\"Términos\") rigen su acceso y uso de la Herramienta de Planificación ABLE (la \"Herramienta\") proporcionada por Spectra Professional Services, LLC. (\"Compañía\", \"nosotros\" o \"nuestro\"). Al acceder o usar la Herramienta, usted acepta quedar obligado por estos Términos. Si no está de acuerdo, no debe usar la Herramienta.\n1. Solo para fines informativos y educativos\nEsta Herramienta se proporciona únicamente con fines informativos y educativos generales. No tiene la intención de proporcionar asesoría legal, fiscal, de inversión ni financiera, y no debe considerarse un sustituto de la asesoría de profesionales calificados.\n2. Sin garantía de resultados\nTodas las proyecciones, gráficos e informes generados por esta Herramienta son hipotéticos y se basan en supuestos proporcionados por el usuario. Los resultados reales pueden diferir de manera significativa. No existe garantía de que se logren saldos proyectados, rendimientos de inversión, elegibilidad de contribución o beneficios fiscales.\n3. Riesgo de pérdida\nUsted puede perder parte o la totalidad del dinero invertido en una cuenta ABLE.\n4. Riesgo de inversión\nLas cuentas ABLE están sujetas al riesgo de mercado, incluida la posible pérdida del principal. Los rendimientos de inversión no están garantizados y el desempeño pasado no indica resultados futuros. Los cambios en condiciones de mercado, tarifas, gastos y selecciones de inversión pueden afectar significativamente los resultados. No se simulan la volatilidad del mercado, el riesgo de secuencia de rendimientos ni la variación intranual de rendimientos.\n5. Supuestos y simplificaciones\nEsta Herramienta se basa en supuestos simplificados, incluidas tasas de rendimiento estimadas, cronogramas regulares de contribuciones y retiros, y un tratamiento simplificado de impuestos y beneficios fiscales. Las reglas reales de los programas ABLE, el desempeño de inversión y el tratamiento fiscal varían por estado y pueden cambiar con el tiempo.\n\n6. Límites de contribución y elegibilidad\nLos límites de contribución, las reglas de elegibilidad, los beneficios federales y estatales, y el tratamiento fiscal se rigen por leyes federales y estatales y por las reglas de cada programa ABLE. Esta Herramienta no determina elegibilidad ni cumplimiento y no debe utilizarse para tomar decisiones finales de contribución o retiro.\n7. Retiros y gastos calificados\nPor lo general, los retiros deben utilizarse para gastos calificados relacionados con la discapacidad para evitar consecuencias fiscales adversas. Esta Herramienta no evalúa si los retiros planificados califican conforme a las reglas aplicables.\n8. No constituye oferta ni recomendación\nNada de lo contenido en esta Herramienta constituye una oferta de venta, una solicitud de oferta de compra, ni una recomendación respecto de ninguna inversión, valor o producto financiero.\n9. Limitación de responsabilidad\nEn la máxima medida permitida por la ley, Spectra Professional Services, LLC. no será responsable por daños indirectos, incidentales, especiales, consecuentes, ejemplares o punitivos, ni por pérdida de ganancias, ingresos, datos, reputación comercial u oportunidades de negocio que surjan de o estén relacionados con su uso de la Herramienta, ya sea por contrato, agravio (incluida negligencia), responsabilidad estricta u otra teoría, incluso si se advirtió sobre la posibilidad de dichos daños.\nLa responsabilidad total, si existiera, no excederá el monto pagado por usted, si lo hubiera, por el acceso a la Herramienta.\n10. Indemnización\nUsted acepta indemnizar, defender y mantener indemne a Spectra Professional Services, LLC., sus directivos, directores, empleados, afiliadas y agentes frente a cualquier reclamo, responsabilidad, daño, pérdida y gasto, incluidos honorarios razonables de abogados, que surjan de o estén relacionados con su uso de la Herramienta o con la violación de estos Términos.\n11. Ley aplicable\nEstos Términos se regirán e interpretarán de conformidad con las leyes del Estado de Nueva York y las leyes federales aplicables de los Estados Unidos, sin considerar principios de conflicto de leyes. Cualquier disputa se resolverá en un tribunal con jurisdicción competente.\n12. Uso bajo su propio criterio\nAl usar esta Herramienta, usted reconoce que es el único responsable de cómo interpreta y usa la información proporcionada. Para orientación específica a su situación, debe consultar a un profesional calificado en materia financiera, fiscal o legal, o al administrador del programa ABLE de su estado.\n13. Información de contacto\nSi tiene preguntas sobre estos Términos, comuníquese con Spectra Professional Services, LLC. en: ableplannertool@spectraps.com\n14. Compromiso de accesibilidad\nSpectra Professional Services, LLC está comprometida con hacer la Herramienta accesible para personas con discapacidad y procura cumplir con estándares de accesibilidad generalmente reconocidos, incluidas las Pautas de Accesibilidad para el Contenido Web (WCAG), cuando corresponda. Si tiene dificultades para acceder a cualquier parte de la Herramienta, comuníquese con nosotros para que podamos ofrecer adaptaciones razonables o acceso alternativo.\n15. Derechos de autor, marcas y propiedad\nTodo el contenido, software, cálculos, diseños, gráficos, texto, informes, proyecciones y otros materiales disponibles a través de la Herramienta (en conjunto, el \"Contenido\") son propiedad de Spectra Professional Services, LLC. o de sus licenciantes y están protegidos por leyes de propiedad intelectual de los Estados Unidos e internacionales.\nLos nombres, logotipos, nombres de productos, nombres de servicios, diseños y elementos visuales asociados con la Herramienta (en conjunto, las \"Marcas\") son marcas comerciales, marcas de servicio o imagen comercial de Spectra Professional Services, LLC. o sus licenciantes. El uso no autorizado de cualquier Marca está estrictamente prohibido.\nSu uso de la Herramienta no le concede ningún derecho de propiedad sobre el Contenido o las Marcas. No se le transfiere ningún derecho, título o interés sobre ningún Contenido.\nPuede usar la Herramienta y su Contenido únicamente para su uso personal y no comercial en relación con la evaluación de escenarios de planificación de cuentas ABLE. Salvo lo expresamente permitido en estos Términos, no puede copiar, reproducir, distribuir, republicar, cargar, publicar, transmitir, modificar, crear obras derivadas, vender, licenciar, explotar comercialmente, eliminar avisos de propiedad, realizar ingeniería inversa, descompilar, desensamblar ni intentar extraer el código fuente subyacente de la Herramienta.\nCualquier uso no autorizado del Contenido o de las Marcas puede violar leyes de propiedad intelectual y puede dar lugar a acciones legales.\n16. Enlaces externos\nLa Herramienta puede contener enlaces a sitios web o recursos de terceros para su conveniencia. Spectra Professional Services, LLC. no controla, opera ni respalda sitios web, productos o servicios de terceros, y no es responsable de su contenido, exactitud, disponibilidad o prácticas.\nEl acceso a cualquier sitio web de terceros es bajo su propio riesgo y está sujeto a los términos y políticas de esos sitios.\nNo puede crear ni mantener un enlace a la Herramienta desde otro sitio web sin nuestro consentimiento previo por escrito. Está prohibido enmarcar, incrustar, reflejar o mostrar de cualquier otra forma cualquier parte de la Herramienta en otro sitio web sin autorización previa por escrito.\nCualquier enlace permitido debe cumplir con todas las leyes y regulaciones aplicables. Nos reservamos el derecho de revocar el permiso de enlace en cualquier momento y a nuestra sola discreción.\n17. Exclusión de garantías\nLA HERRAMIENTA SE PROPORCIONA \"TAL CUAL\" Y \"SEGÚN DISPONIBILIDAD\", SIN GARANTÍAS DE NINGÚN TIPO, YA SEAN EXPRESAS, IMPLÍCITAS O LEGALES.\nEN LA MÁXIMA MEDIDA PERMITIDA POR LA LEY, SPECTRA PROFESSIONAL SERVICES, LLC. RENUNCIA A TODAS LAS GARANTÍAS, INCLUIDAS, ENTRE OTRAS, LAS GARANTÍAS IMPLÍCITAS DE COMERCIABILIDAD, IDONEIDAD PARA UN PROPÓSITO PARTICULAR, TÍTULO Y NO INFRACCIÓN.\nNO GARANTIZAMOS QUE LA HERRAMIENTA FUNCIONE DE FORMA ININTERRUMPIDA, LIBRE DE ERRORES, SEGURA O LIBRE DE VIRUS U OTROS COMPONENTES DAÑINOS, NI QUE CUALQUIER DEFECTO SEA CORREGIDO.\nEL USO DE LA HERRAMIENTA ES BAJO SU PROPIO RIESGO.\n18. Divisibilidad\nSi alguna disposición de estos Términos se considera inválida, ilegal o inaplicable conforme a la ley aplicable, las disposiciones restantes permanecerán en pleno vigor y efecto. Cualquier disposición inválida o inaplicable se interpretará en la máxima medida permitida por la ley para reflejar la intención original de las partes.\n19. Acuerdo completo\nEstos Términos constituyen el acuerdo completo entre usted y Spectra Professional Services, LLC. respecto de su uso de la Herramienta y sustituyen todos los entendimientos, acuerdos, declaraciones y comunicaciones anteriores o contemporáneos, ya sean escritos u orales, relacionados con la Herramienta.\n20. Modificaciones de estos Términos\nSpectra Professional Services, LLC. se reserva el derecho de modificar o actualizar estos Términos en cualquier momento. Los Términos actualizados serán efectivos al publicarse dentro de la Herramienta o en cualquier sitio web asociado. Su uso continuado de la Herramienta después de dichos cambios constituye su aceptación de los Términos revisados.\n\n\n21. Renuncia\nNinguna falta o demora de Spectra Professional Services, LLC. en el ejercicio de cualquier derecho bajo estos Términos constituirá una renuncia a ese derecho. Toda renuncia debe constar por escrito y estar firmada por un representante autorizado de Spectra Professional Services, LLC.\nAceptación electrónica\nAl hacer clic en el botón \"Aceptar y continuar\", usted reconoce que ha leído, entendido y acepta quedar legalmente obligado por estos Términos de Uso. Si no está de acuerdo con estos Términos, no debe hacer clic en el botón y no puede usar la Herramienta.\nSu aceptación electrónica de estos Términos constituye un acuerdo legalmente vinculante equivalente a una firma manuscrita.",
    "termsOfUseLinkLabel": "Términos de uso",
    "termsOfUseTitle": "Términos de uso"
  }
}
