{
  "clientId": "il",
  "planStateCode": "IL",
  "defaults": {
    "annualReturn": 0.06,
    "timeHorizonYears": 40
  },
  "constraints": {
    "annualReturnWarningMax": 0.12,
    "annualReturnHardMax": 0.25,
    "timeHorizonYearsHardMin": 3,
    "timeHorizonYearsHardMax": 60
  },
  "brand": {
    "primary": "#E8590C",
    "primaryHover": "#C14708",
    "onPrimary": "#FFFFFF",
    "ring": "rgba(232, 89, 12, 0.35)"
  },
  "typography": {
    "fontFamily": "-apple-system, BlinkMacSystemFont, \"SF Pro Text\", \"SF Pro Display\", system-ui, sans-serif",
    "baseFontSizePx": 18,
    "lineHeight": 1.45
  },
  "features": {
    "reports": {
      "tabs": [
        "account_growth",
        "able_vs_taxable",
        "tax_benefits",
        "taxable_growth"
      ]
    }
  },
  "clientBlocks": {
    "disclosuresAssumptions": {
      "en": "This planner is for ABLE account savings planning only and does not provide legal, tax, investment, or financial advice.\n\nResults are deterministic projections based entirely on user inputs and configured rules; they are not predictions of actual future performance.\n\nInvestment return is modeled as a constant annual rate converted to a constant monthly rate for projection purposes.\n\nContributions and withdrawals are modeled as recurring monthly cash flows according to user-entered values.\n\nThe contribution period ends on the selected Contribution End Date, or earlier if automatic stop rules apply due to plan account balance limits or SSI limits, if applicable.\n\nThe withdrawal period begins on the selected Withdrawal Start Date.\n\nContribution increase percentage and withdrawal increase percentage are applied in annual intervals.\n\nWhen contribution increases would exceed annual contribution limits, contribution increases are stopped according to planner limit logic.\n\nABLE to Work, if eligible, is modeled using entered earned income and configured poverty-level constraints to determine additional contribution allowance.\n\nIf ABLE to Work is not used or not eligible, baseline annual contribution limits are enforced in planner logic.\n\nFederal Saver's Credit is estimated from taxable income and filing status inputs using most recent Federal Tax brackets and Federal limit rules.\n\nState tax benefit estimates, deduction or credit, are based on current state rules and filing status logic.\n\nTax benefits are capped by estimated liability where applicable under configured rules.\n\nTaxable-account federal and state tax drag are estimated from configured tax rates and rules and applied in the taxable projection model.\n\nTaxable-account tax drag is shown as a negative impact in comparison outputs.\n\nABLE and taxable account comparisons assume identical user cash-flow assumptions unless rule-based constraints alter ABLE account behavior.\n\nIf SSI eligibility is enabled, the planner applies SSI balance-cap behavior, including stopping contributions and applying required withdrawals as modeled.\n\nIf a plan account balance maximum constraint is reached, planner logic stops contributions per configured rules.\n\nIf requested withdrawals exceed available funds, withdrawals are limited to available balance and balances are not allowed to go negative.\n\nProjection horizon is limited to the configured maximum allowable years for the selected client or state experience.\n\nReport Window controls filter the displayed reporting range within the full calculated schedule.\n\nChart display ends at the first month where projected ending balance reaches zero, when applicable.\n\nCertain chart components use smoothing or distribution for visualization readability; detailed month-level schedule values remain the system of record for exact month results.\n\nCurrency values are rounded and formatted for display; minor visual differences may occur versus underlying calculation precision.\n\nOutputs depend on selected language and client configuration, including labels, tab availability and order, and presentation behaviors.\n\nState and federal program rules may change over time; this planner reflects only the currently loaded rules and configuration set.\n\nEligibility and compliance decisions should be confirmed with qualified professionals and official ABLE program guidance before acting.",
      "es": "Este planificador es solo para la planificación de ahorro en cuentas ABLE y no proporciona asesoramiento legal, fiscal, de inversión ni financiero.\n\nLos resultados son proyecciones determinísticas basadas por completo en los datos ingresados por el usuario y en reglas configuradas; no son predicciones del desempeño real futuro.\n\nEl rendimiento de inversión se modela como una tasa anual constante convertida a una tasa mensual constante para fines de proyección.\n\nLas contribuciones y los retiros se modelan como flujos de efectivo mensuales recurrentes según los valores ingresados por el usuario.\n\nEl período de contribuciones termina en la fecha de fin de contribución seleccionada, o antes si aplican reglas automáticas de detención por límites de saldo máximo del plan o límites de SSI, cuando corresponda.\n\nEl período de retiros comienza en la fecha de inicio de retiro seleccionada.\n\nLos porcentajes de aumento de contribución y de retiro se aplican en intervalos anuales.\n\nCuando los aumentos de contribución excederían los límites anuales, esos aumentos se detienen según la lógica de límites del planificador.\n\nABLE to Work, si corresponde, se modela con el ingreso laboral ingresado y restricciones configuradas del nivel de pobreza para determinar el aporte adicional permitido.\n\nSi ABLE to Work no se usa o no es elegible, la lógica del planificador aplica los límites anuales base de contribución.\n\nEl Crédito Federal del Ahorrador se estima con el ingreso imponible y el estado civil para impuestos mediante los tramos federales más recientes y reglas de límites federales.\n\nLas estimaciones de beneficios fiscales estatales, deducción o crédito, se basan en reglas estatales vigentes y lógica de estado civil para impuestos.\n\nCuando corresponde según las reglas configuradas, los beneficios fiscales se limitan por la obligación tributaria estimada.\n\nEl impacto fiscal federal y estatal de la cuenta gravable se estima con tasas y reglas configuradas y se aplica en el modelo de proyección gravable.\n\nEl impacto fiscal de la cuenta gravable se muestra como efecto negativo en las salidas de comparación.\n\nLas comparaciones entre cuentas ABLE y gravables asumen los mismos flujos de efectivo ingresados por el usuario, salvo que restricciones de reglas modifiquen el comportamiento de la cuenta ABLE.\n\nSi la elegibilidad de SSI está habilitada, el planificador aplica el comportamiento de límite de saldo SSI, incluyendo la detención de contribuciones y retiros requeridos según el modelo.\n\nSi se alcanza una restricción de saldo máximo de la cuenta del plan, la lógica del planificador detiene las contribuciones según reglas configuradas.\n\nSi los retiros solicitados exceden los fondos disponibles, los retiros se limitan al saldo disponible y no se permiten saldos negativos.\n\nEl horizonte de proyección está limitado por el máximo de años permitido en la configuración del cliente o estado seleccionado.\n\nLos controles de Ventana de reporte filtran el rango mostrado dentro del cronograma completo calculado.\n\nLa visualización del gráfico termina en el primer mes en que el saldo final proyectado llega a cero, cuando corresponda.\n\nCiertos componentes de gráficos usan suavizado o distribución para facilitar la lectura visual; los valores detallados del cronograma mensual siguen siendo la referencia para resultados exactos por mes.\n\nLos valores monetarios se redondean y formatean para su visualización; pueden existir diferencias visuales menores frente a la precisión interna del cálculo.\n\nLas salidas dependen del idioma y la configuración del cliente seleccionados, incluidas etiquetas, disponibilidad y orden de pestañas y comportamientos de presentación.\n\nLas reglas de programas estatales y federales pueden cambiar con el tiempo; este planificador refleja solo el conjunto de reglas y configuraciones cargado actualmente.\n\nLas decisiones de elegibilidad y cumplimiento deben confirmarse con profesionales calificados y con la guía oficial del programa ABLE antes de actuar."
    },
    "rightCardPrimary": {
      "en": "This is where the ABLE planner shares updates, alerts, and guidance based on your inputs and may ask for additional information.\n\nPlease use the input fields to provide the requested information for the ABLE planner.",
      "es": "Aqui es donde el planificador ABLE comparte actualizaciones, alertas y orientacion basadas en sus entradas, y puede solicitar informacion adicional.\n\nUse los campos de entrada para proporcionar la informacion solicitada para el planificador ABLE."
    },
    "rightCardSecondary": {
      "en": "This is where the ABLE planner shares updates, alerts, and guidance based on your inputs and may ask for additional information.\n\nPlease use the Account Activity input fields to define your planning assumptions.",
      "es": "Use los campos de Actividad de la cuenta para definir sus supuestos de planificacion."
    }
  },
  "landing": {
    "en": {
      "heroTitle": "Welcome to the Illinois ABLE Planner",
      "heroBody": "An ABLE account can be a powerful tool for saving, investing, and paying for qualified disability-related expenses—without jeopardizing critical public benefits.\n\nThis planning tool helps you explore different scenarios, compare outcomes, and better understand how today’s decisions may affect future balances.\n\nUse this tool to:",
      "heroBullets": [
        "Explore long-term ABLE account growth under different assumptions",
        "Understand how contribution limits and eligibility rules may apply",
        "Model withdrawals alongside ongoing contributions",
        "Review projected balances, summaries, and charts across time"
      ],
      "agreeToTermsPrefix": "I agree to the",
      "termsOfUseLinkLabel": "Terms of Use",
      "agreeAndContinueLabel": "Agree and Continue",
      "termsOfUseTitle": "Terms of Use",
      "termsOfUseBody": "These Terms of Use (\"Terms\") govern your access to and use of the ABLE Planning Tool (the \"Tool\") provided by Spectra Professional Services, LLC. (\"Company,\" \"we,\" \"us,\" or \"our\"). By accessing or using the Tool, you agree to be bound by these Terms. If you do not agree, you should not use the Tool.\n\n1. Informational and Educational Purposes Only\nThis Tool is provided solely for general informational and educational purposes. It is not intended to provide legal, tax, investment, or financial advice, and should not be relied upon as a substitute for advice from qualified professionals.\n\n2. No Guarantee of Results\nAll projections, charts, and reports generated by this Tool are hypothetical and based on user-provided assumptions. Actual results may differ materially. There is no guarantee that projected balances, investment returns, contribution eligibility, or tax benefits will be achieved.\n\n3. Risk of Loss\nYou may lose some or all of the money invested in an ABLE account.\n\n4. Investment Risk\nABLE accounts are subject to market risk, including the possible loss of principal. Investment returns are not guaranteed, and past performance is not indicative of future results. Changes in market conditions, fees, expenses, and investment selections may significantly affect outcomes. Market volatility, sequence-of-returns risk, and intra-year return variation are not simulated.\n\n5. Assumptions and Simplifications\nThis Tool relies on simplifying assumptions, including estimated rates of return, regular contribution and withdrawal schedules, and simplified treatment of taxes and tax benefits. Actual ABLE program rules, investment performance, and tax treatment vary by state and may change over time.\n\n6. Contribution Limits and Eligibility\nContribution limits, eligibility rules, federal and state benefits, and tax treatment are governed by federal and state law and individual ABLE program rules. This Tool does not determine eligibility or compliance and should not be used to make final contribution or withdrawal decisions.\n\n7. Withdrawals and Qualified Expenses\nWithdrawals must generally be used for qualified disability expenses to avoid adverse tax consequences. This Tool does not evaluate whether planned withdrawals qualify under applicable rules.\n\n8. Not an Offer or Recommendation\nNothing contained in this Tool constitutes an offer to sell, a solicitation of an offer to buy, or a recommendation regarding any investment, security, or financial product.\n\n9. Limitation of Liability\nTo the fullest extent permitted by law, Spectra Professional Services, LTD. shall not be liable for any indirect, incidental, special, consequential, or punitive damages, or for any loss of profits, data, or goodwill arising out of or related to your use of the Tool. Total liability, if any, shall not exceed the amount paid by you, if any, for access to the Tool.\n\n10. Indemnification\nYou agree to indemnify, defend, and hold harmless Spectra Professional Services, LTD., its officers, directors, employees, and affiliates from and against any claims, liabilities, damages, losses, and expenses arising out of or related to your use of the Tool or violation of these Terms.\n\n11. Governing Law\nThese Terms shall be governed by and construed in accordance with the applicable state and federal laws of the United States, without regard to conflict of law principles. Any disputes shall be resolved in a court of competent jurisdiction.\n\n12. Use at Your Own Discretion\nBy using this Tool, you acknowledge that you are solely responsible for how you interpret and use the information provided. For guidance specific to your situation, you should consult a qualified financial, tax, or legal professional, or your state's ABLE program administrator.\n\n13. Contact Information\nIf you have questions about these Terms, please contact Spectra Professional Services, LLC. at: ableplannertool@spectraps.com\n\nElectronic Acceptance\nBy clicking the button labeled \"Agree and Continue\" you acknowledge that you have read, understood, and agree to be legally bound by these Terms of Use. If you do not agree to these Terms, you must not click the button and may not use the Tool.\n\nYour electronic acceptance of these Terms constitutes a legally binding agreement equivalent to a handwritten signature."
    },
    "es": {
      "heroTitle": "Bienvenido al Planificador ABLE de Illinois",
      "heroBody": "Una cuenta ABLE puede ser una herramienta potente para ahorrar, invertir y pagar gastos relacionados con la discapacidad sin poner en riesgo beneficios públicos esenciales. Esta herramienta de planificación le ayuda a explorar distintos escenarios, comparar resultados y comprender mejor cómo las decisiones de hoy pueden afectar los saldos del futuro. Explore cómo las contribuciones, los retiros, el crecimiento de las inversiones y los límites del programa pueden interactuar con el tiempo.",
      "heroBullets": [
        "Explorar el crecimiento a largo plazo de ABLE con distintos supuestos",
        "Entender límites de contribución y reglas de elegibilidad",
        "Modelar retiros junto con contribuciones",
        "Revisar saldos proyectados, resúmenes y gráficos en el tiempo"
      ],
      "agreeToTermsPrefix": "Acepto los",
      "termsOfUseLinkLabel": "Términos de uso",
      "agreeAndContinueLabel": "Aceptar y continuar",
      "termsOfUseTitle": "Términos de uso",
      "termsOfUseBody": "Términos de uso\nEl contenido completo de los Términos de uso se proporcionará y se insertará aquí. Esta sección es independiente del contenido de Divulgaciones y limitaciones importantes mostrado arriba.\n\nEl uso de este planificador estará sujeto a los Términos de uso una vez que se publiquen en esta sección."
    }
  }
}
