{
  "clientId": "il",
  "planStateCode": "IL",
  "defaults": {
    "annualReturn": 0.06,
    "timeHorizonYears": 40
  },
  "constraints": {
    "annualReturnWarningMax": 0.12,
    "annualReturnHardMax": 0.25,
    "timeHorizonYearsHardMin": 1,
    "timeHorizonYearsHardMax": 60
  },
  "brand": {
    "primary": "#E8590C",
    "primaryHover": "#C14708",
    "onPrimary": "#FFFFFF",
    "ring": "rgba(232, 89, 12, 0.35)"
  },
  "typography": {
    "fontFamily": "-apple-system, BlinkMacSystemFont, \"SF Pro Text\", \"SF Pro Display\", system-ui, sans-serif",
    "baseFontSizePx": 16,
    "lineHeight": 1.45
  }
,
  "clientBlocks": {
    "landingWelcome": {
      "en": "ILLINOIS TEST — Welcome to the ABLE Planner for Illinois residents.",
      "es": "PRUEBA ILLINOIS — Bienvenido al Planificador ABLE para residentes de Illinois."
    },
    "disclosuresAssumptions": {
      "en": "ILLINOIS TEST — These assumptions and disclosures apply specifically to Illinois.",
      "es": "PRUEBA ILLINOIS — Estas suposiciones y divulgaciones aplican específicamente a Illinois."
    },
    "rightCardPrimary": {
      "en": "Welcome to our interactive ABLE planning tool. Start by providing basic demographic information on the left input screen. You will be able to navigate to any of the input screens to edit all this information.\n\nYour state of residence is used to determine plan eligibility as well as to calculate certain state tax benefits.\n\nSimilarly, your tax filing status and Adjusted Gross Income (AGI) will help us determine and project federal and, where applicable, state tax benefits of investing in an ABLE account. Remember that your AGI is not the same as your salary. It may be more than your earned income due to other sources of income. Conversely, for most taxpayers, it often is less than your earned income due to deductions or exemptions. You can find your AGI in your most recent tax return if you filed one. If you are not sure what your current AGI is, simply put your salary and wages.\n\nFinally, we proposed a default investment return assumption. Feel free to change the investment return assumption to try out different scenarios.",
      "es": "Bienvenido a nuestra herramienta interactiva de planificación ABLE. Comience proporcionando información demográfica básica en la pantalla de entradas de la izquierda. Podrá navegar a cualquiera de las pantallas de entrada para editar toda esta información.\n\nSu estado de residencia se utiliza para determinar la elegibilidad del plan y también para calcular ciertos beneficios fiscales estatales.\n\nDe manera similar, su estado civil para impuestos y su Ingreso Bruto Ajustado (AGI) nos ayudarán a determinar y proyectar beneficios fiscales federales y, cuando corresponda, estatales de invertir en una cuenta ABLE. Recuerde que su AGI no es lo mismo que su salario. Puede ser mayor que su ingreso del trabajo debido a otras fuentes de ingresos. Por el contrario, para la mayoría de los contribuyentes, a menudo es menor que su ingreso del trabajo debido a deducciones o exenciones. Puede encontrar su AGI en su declaración de impuestos más reciente si presentó una. Si no está seguro de cuál es su AGI actual, simplemente ingrese su salario y sueldos.\n\nFinalmente, propusimos una suposición predeterminada de rendimiento de inversión. Siéntase libre de cambiar la suposición de rendimiento de inversión para probar diferentes escenarios."
    },
    "rightCardSecondary": {
      "en": "ILLINOIS TEST — Secondary informational message for Illinois users.",
      "es": "PRUEBA ILLINOIS — Mensaje informativo secundario para usuarios de Illinois."
    }
  }
}
