{
  "clientId": "il",
  "planStateCode": "IL",
  "defaults": {
    "annualReturn": 0.06,
    "timeHorizonYears": 40
  },
  "constraints": {
    "annualReturnWarningMax": 0.12,
    "annualReturnHardMax": 0.25,
    "timeHorizonYearsHardMin": 3,
    "timeHorizonYearsHardMax": 60
  },
  "brand": {
    "primary": "#E8590C",
    "primaryHover": "#C14708",
    "onPrimary": "#FFFFFF",
    "ring": "rgba(232, 89, 12, 0.35)"
  },
  "typography": {
    "fontFamily": "-apple-system, BlinkMacSystemFont, \"SF Pro Text\", \"SF Pro Display\", system-ui, sans-serif",
    "baseFontSizePx": 18,
    "lineHeight": 1.45
  },
  "features": {
    "reports": {
      "tabs": ["account_growth", "tax_benefits", "taxable_growth", "able_vs_taxable"]
    }
  },
  "clientBlocks": {
    "disclosuresAssumptions": {
      "en": "Taxable income is used for estimating federal and state tax benefits.\n\nFederal Saver’s Credit and state tax benefits are capped by estimated tax liability when applicable.\n\nTax rules vary and may change; these results are estimates for planning purposes only.",
      "es": "Se usa el ingreso imponible para estimar beneficios fiscales federales y estatales.\n\nEl Crédito del Ahorrador federal y los beneficios fiscales estatales se limitan por la obligación tributaria estimada cuando corresponda.\n\nLas reglas fiscales varían y pueden cambiar; estos resultados son estimaciones solo para fines de planificación."
    },
    "rightCardPrimary": {
      "en": "This is where the ABLE planner shares updates, alerts, and guidance based on your inputs and may ask for additional information.\n\nPlease use the input fields to provide the requested information for the ABLE planner.\n\nUse the information icons next to each input for field-specific guidance.",
      "es": "Aqui es donde el planificador ABLE comparte actualizaciones, alertas y orientacion basadas en sus entradas, y puede solicitar informacion adicional.\n\nUse los campos de entrada para proporcionar la informacion solicitada para el planificador ABLE.\n\nUse los iconos de informacion junto a cada campo para orientacion especifica."
    },
    "rightCardSecondary": {
      "en": "This is where the ABLE planner shares updates, alerts, and guidance based on your inputs and may ask for additional information.\n\nPlease use the Account Activity input fields to define your planning assumptions.\n\nUse the information icons next to each input for field-specific guidance.",
      "es": "Use los campos de Actividad de la cuenta para definir sus supuestos de planificacion.\n\nUse los íconos de información junto a cada campo para ver orientación específica."
    }
  },
  "landing": {
    "en": {
      "disclosuresBody": "This tool is for informational and educational purposes only\nThis ABLE planning tool is provided solely for general informational and educational purposes. It is not intended to provide legal, tax, investment, or financial advice, and should not be relied upon as a substitute for advice from qualified professionals.\n\nNo guarantee of results\nAll projections, charts, and reports generated by this tool are hypothetical and based on user-provided assumptions. Actual results may differ materially. There is no guarantee that projected balances, investment returns, contribution eligibility, or tax benefits will be achieved.\n\nYou may lose some or all of the money invested in an ABLE account.\n\nInvestment risk\nABLE accounts are subject to market risk, including the possible loss of principal. Investment returns are not guaranteed, and past performance is not indicative of future results. Changes in market conditions, fees, expenses, and investment selections may significantly affect outcomes.\n\nAssumptions and simplifications\nThis tool relies on simplifying assumptions, which may include constant or estimated rates of return, regular contribution and withdrawal schedules, and simplified treatment of taxes and tax benefits. Actual ABLE program rules, investment performance, and tax treatment vary by state and may change over time.\n\nContribution limits and eligibility\nAnnual contribution limits, Work-to-ABLE eligibility, federal benefits, state benefits, and tax treatment are governed by federal and state law and individual ABLE program rules. This tool does not determine eligibility or compliance and should not be used to make final contribution or withdrawal decisions.\n\nWithdrawals and qualified expenses\nWithdrawals from an ABLE account must generally be used for qualified disability expenses to avoid adverse tax consequences. This tool does not evaluate whether planned withdrawals qualify under applicable rules.\n\nNot an offer or recommendation\nNothing contained in this tool constitutes an offer to sell, a solicitation of an offer to buy, or a recommendation regarding any investment, security, or financial product.\n\nUse at your own discretion\nBy using this tool, you acknowledge that you are solely responsible for how you interpret and use the information provided. For guidance specific to your situation, consider consulting a qualified financial, tax, or legal professional, or your state’s ABLE program administrator.",
      "disclosuresIntro": "Please read the following important disclosures and limitations before using this tool.",
      "disclosuresTitle": "Important Disclosures and Limitations",
      "heroBody": "An ABLE account can be a powerful tool for saving, investing, and paying for qualified disability-related expenses—without jeopardizing critical public benefits.\n\nThis planning tool helps you explore different scenarios, compare outcomes, and better understand how today’s decisions may affect future balances.\n\nUse this tool to:",
      "heroBullets": [
        "Explore long-term ABLE account growth under different assumptions",
        "Understand how contribution limits and eligibility rules may apply",
        "Understand account balance limits",
        "Model withdrawals alongside ongoing contributions",
        "Review projected balances, summaries, and charts across time"
      ],
      "heroSubtitle": "Explore how contributions, withdrawals, investment growth, and program limits may interact over time.",
      "heroTitle": "Welcome to the Illinois ABLE Planner"
    },
    "es": {
      "disclosuresBody": "Esta herramienta tiene fines únicamente informativos y educativos.\nEsta herramienta de planificación ABLE se ofrece exclusivamente con fines informativos y educativos generales. No está diseñada para brindar asesoramiento legal, fiscal, financiero o de inversión, y no debe tomarse como un sustituto del consejo de profesionales calificados.\n\nSin garantía de resultados\nTodas las proyecciones, gráficos e informes generados por esta herramienta son hipotéticos y se basan en supuestos proporcionados por el usuario. Los resultados reales pueden diferir materialmente. No se garantiza que se alcancen los saldos proyectados, los rendimientos de inversión, la elegibilidad para contribuciones o los beneficios fiscales.\n\nPuede perder parte o la totalidad del dinero invertido en una cuenta ABLE.\n\nRiesgo de inversión\nLas cuentas ABLE están sujetas al riesgo de mercado, incluida la posible pérdida del capital. Los rendimientos de la inversión no están garantizados, y el desempeño pasado no indica resultados futuros. Los cambios en las condiciones del mercado, tarifas, gastos y selecciones de inversión pueden afectar significativamente los resultados.\n\nSupuestos y simplificaciones\nEsta herramienta depende de supuestos simplificados, que pueden incluir tasas de retorno constantes o estimadas, cronogramas regulares de contribuciones y retiros, y un tratamiento simplificado de impuestos y beneficios fiscales. Las reglas reales del programa ABLE, el desempeño de las inversiones y el tratamiento fiscal varían según el estado y pueden cambiar con el tiempo.\n\nLímites de contribución y elegibilidad\nLos límites de contribución anual, la elegibilidad para Work-to-ABLE, los beneficios federales, los beneficios estatales y el tratamiento fiscal están gobernados por las leyes federales y estatales y las reglas individuales de cada programa ABLE. Esta herramienta no determina elegibilidad ni cumplimiento, y no debe usarse para tomar decisiones finales sobre contribuciones o retiros.\n\nRetiros y gastos calificados\nLos retiros de una cuenta ABLE deben usarse generalmente para gastos calificados relacionados con la discapacidad para evitar consecuencias fiscales adversas. Esta herramienta no evalúa si los retiros planificados cumplen con las reglas aplicables.\n\nNo constituye una oferta ni una recomendación\nNada de lo contenido en esta herramienta constituye una oferta para vender, una solicitud para comprar o una recomendación sobre ningún producto financiero, inversión o valor.\n\nÚselo bajo su propio criterio\nAl utilizar esta herramienta, reconoce que usted es el único responsable de cómo interpreta y usa la información proporcionada. Para obtener orientación específica a su situación, considere consultar a un profesional calificado en finanzas, impuestos o derecho, o al administrador del programa ABLE de su estado.",
      "disclosuresIntro": "Por favor, lea las siguientes divulgaciones y limitaciones importantes antes de usar esta herramienta.",
      "disclosuresTitle": "Divulgaciones y limitaciones importantes",
      "heroBody": "Una cuenta ABLE puede ser una herramienta potente para ahorrar, invertir y pagar gastos relacionados con la discapacidad sin poner en riesgo beneficios públicos esenciales. Esta herramienta de planificación le ayuda a explorar distintos escenarios, comparar resultados y comprender mejor cómo las decisiones de hoy pueden afectar los saldos del futuro. Explore cómo las contribuciones, los retiros, el crecimiento de las inversiones y los límites del programa pueden interactuar con el tiempo.",
      "heroBullets": [
        "Explorar el crecimiento a largo plazo de ABLE con distintos supuestos",
        "Entender límites de contribución y reglas de elegibilidad",
        "Modelar retiros junto con contribuciones",
        "Revisar saldos proyectados, resúmenes y gráficos en el tiempo"
      ],
      "heroSubtitle": "Explore cómo las contribuciones, los retiros, el crecimiento de las inversiones y los límites del programa pueden interactuar con el tiempo.",
      "heroTitle": "Bienvenido al Planificador ABLE"
    }
  }
}
