{
  "clientId": "il",
  "planStateCode": "IL",
  "enrollmentPageUrl": "https://savewithable.com/enroll/il-navigator.html",
  "defaults": {
    "annualReturn": 0.06,
    "timeHorizonYears": 40
  },
  "constraints": {
    "annualReturnWarningMax": 0.12,
    "annualReturnHardMax": 0.25,
    "timeHorizonYearsHardMin": 3,
    "timeHorizonYearsHardMax": 60
  },
  "brand": {
    "primary": "#E8590C",
    "primaryHover": "#C14708",
    "onPrimary": "#FFFFFF",
    "ring": "rgba(232, 89, 12, 0.35)"
  },
  "typography": {
    "fontFamily": "-apple-system, BlinkMacSystemFont, \"SF Pro Text\", \"SF Pro Display\", system-ui, sans-serif",
    "baseFontSizePx": 18,
    "lineHeight": 1.45
  },
  "features": {
    "reports": {
      "tabs": [
        "account_growth",
        "able_vs_taxable",
        "tax_benefits",
        "taxable_growth"
      ]
    }
  },
  "clientBlocks": {
    "disclosuresAssumptions": {
      "en": "This planner is for ABLE account savings planning only and does not provide legal, tax, investment, or financial advice.\n\nResults are deterministic projections based entirely on user inputs and configured rules; they are not predictions of actual future performance.\n\nInvestment return is modeled as a constant annual rate converted to a constant monthly rate for projection purposes.\n\nContributions and withdrawals are modeled as recurring monthly cash flows according to user-entered values.\n\nThe contribution period ends on the selected Contribution End Date, or earlier if automatic stop rules apply due to plan account balance limits or SSI limits, if applicable.\n\nThe withdrawal period begins on the selected Withdrawal Start Date.\n\nContribution increase percentage and withdrawal increase percentage are applied in annual intervals.\n\nWhen contribution increases would exceed annual contribution limits, contribution increases are stopped according to planner limit logic.\n\nABLE to Work, if eligible, is modeled using entered earned income and configured poverty-level constraints to determine additional contribution allowance.\n\nIf ABLE to Work is not used or not eligible, baseline annual contribution limits are enforced in planner logic.\n\nFederal Saver's Credit is estimated from taxable income and filing status inputs using most recent Federal Tax brackets and Federal limit rules.\n\nState tax benefit estimates, deduction or credit, are based on current state rules and filing status logic.\n\nTax benefits are capped by estimated liability where applicable under configured rules.\n\nTaxable-account federal and state tax drag are estimated from configured tax rates and rules and applied in the taxable projection model.\n\nTaxable-account tax drag is shown as a negative impact in comparison outputs.\n\nABLE and taxable account comparisons assume identical user cash-flow assumptions unless rule-based constraints alter ABLE account behavior.\n\nIf SSI eligibility is enabled, the planner applies SSI balance-cap behavior, including stopping contributions and applying required withdrawals as modeled.\n\nIf a plan account balance maximum constraint is reached, planner logic stops contributions per configured rules.\n\nIf requested withdrawals exceed available funds, withdrawals are limited to available balance and balances are not allowed to go negative.\n\nProjection horizon is limited to the configured maximum allowable years for the selected client or state experience.\n\nReport Window controls filter the displayed reporting range within the full calculated schedule.\n\nChart display ends at the first month where projected ending balance reaches zero, when applicable.\n\nCertain chart components use smoothing or distribution for visualization readability; detailed month-level schedule values remain the system of record for exact month results.\n\nCurrency values are rounded and formatted for display; minor visual differences may occur versus underlying calculation precision.\n\nOutputs depend on selected language and client configuration, including labels, tab availability and order, and presentation behaviors.\n\nState and federal program rules may change over time; this planner reflects only the currently loaded rules and configuration set.\n\nEligibility and compliance decisions should be confirmed with qualified professionals and official ABLE program guidance before acting.",
      "es": "Este planificador es solo para la planificación de ahorro en cuentas ABLE y no proporciona asesoramiento legal, fiscal, de inversión ni financiero.\n\nLos resultados son proyecciones determinísticas basadas por completo en los datos ingresados por el usuario y en reglas configuradas; no son predicciones del desempeño real futuro.\n\nEl rendimiento de inversión se modela como una tasa anual constante convertida a una tasa mensual constante para fines de proyección.\n\nLas contribuciones y los retiros se modelan como flujos de efectivo mensuales recurrentes según los valores ingresados por el usuario.\n\nEl período de contribuciones termina en la fecha de fin de contribución seleccionada, o antes si aplican reglas automáticas de detención por límites de saldo máximo del plan o límites de SSI, cuando corresponda.\n\nEl período de retiros comienza en la fecha de inicio de retiro seleccionada.\n\nLos porcentajes de aumento de contribución y de retiro se aplican en intervalos anuales.\n\nCuando los aumentos de contribución excederían los límites anuales, esos aumentos se detienen según la lógica de límites del planificador.\n\nABLE to Work, si corresponde, se modela con el ingreso laboral ingresado y restricciones configuradas del nivel de pobreza para determinar el aporte adicional permitido.\n\nSi ABLE to Work no se usa o no es elegible, la lógica del planificador aplica los límites anuales base de contribución.\n\nEl Crédito Federal del Ahorrador se estima con el ingreso imponible y el estado civil para impuestos mediante los tramos federales más recientes y reglas de límites federales.\n\nLas estimaciones de beneficios fiscales estatales, deducción o crédito, se basan en reglas estatales vigentes y lógica de estado civil para impuestos.\n\nCuando corresponde según las reglas configuradas, los beneficios fiscales se limitan por la obligación tributaria estimada.\n\nEl impacto fiscal federal y estatal de la cuenta gravable se estima con tasas y reglas configuradas y se aplica en el modelo de proyección gravable.\n\nEl impacto fiscal de la cuenta gravable se muestra como efecto negativo en las salidas de comparación.\n\nLas comparaciones entre cuentas ABLE y gravables asumen los mismos flujos de efectivo ingresados por el usuario, salvo que restricciones de reglas modifiquen el comportamiento de la cuenta ABLE.\n\nSi la elegibilidad de SSI está habilitada, el planificador aplica el comportamiento de límite de saldo SSI, incluyendo la detención de contribuciones y retiros requeridos según el modelo.\n\nSi se alcanza una restricción de saldo máximo de la cuenta del plan, la lógica del planificador detiene las contribuciones según reglas configuradas.\n\nSi los retiros solicitados exceden los fondos disponibles, los retiros se limitan al saldo disponible y no se permiten saldos negativos.\n\nEl horizonte de proyección está limitado por el máximo de años permitido en la configuración del cliente o estado seleccionado.\n\nLos controles de Ventana de reporte filtran el rango mostrado dentro del cronograma completo calculado.\n\nLa visualización del gráfico termina en el primer mes en que el saldo final proyectado llega a cero, cuando corresponda.\n\nCiertos componentes de gráficos usan suavizado o distribución para facilitar la lectura visual; los valores detallados del cronograma mensual siguen siendo la referencia para resultados exactos por mes.\n\nLos valores monetarios se redondean y formatean para su visualización; pueden existir diferencias visuales menores frente a la precisión interna del cálculo.\n\nLas salidas dependen del idioma y la configuración del cliente seleccionados, incluidas etiquetas, disponibilidad y orden de pestañas y comportamientos de presentación.\n\nLas reglas de programas estatales y federales pueden cambiar con el tiempo; este planificador refleja solo el conjunto de reglas y configuraciones cargado actualmente.\n\nLas decisiones de elegibilidad y cumplimiento deben confirmarse con profesionales calificados y con la guía oficial del programa ABLE antes de actuar."
    },
    "rightCardPrimary": {
      "en": "This is where the ABLE planner shares updates, alerts, and guidance based on your inputs and may ask for additional information.\n\nPlease use the input fields to provide the requested information for the ABLE planner.",
      "es": "Aqui es donde el planificador ABLE comparte actualizaciones, alertas y orientacion basadas en sus entradas, y puede solicitar informacion adicional.\n\nUse los campos de entrada para proporcionar la informacion solicitada para el planificador ABLE."
    },
    "rightCardSecondary": {
      "en": "This is where the ABLE planner shares updates, alerts, and guidance based on your inputs and may ask for additional information.\n\nPlease use the Account Activity input fields to define your planning assumptions.",
      "es": "Use los campos de Actividad de la cuenta para definir sus supuestos de planificacion."
    }
  },
  "landing": {
    "en": {
      "heroTitle": "Welcome to the Illinois ABLE Planner",
      "heroBody": "An ABLE account can be a powerful tool for saving, investing, and paying for qualified disability-related expenses—without jeopardizing critical public benefits.\n\nThis planning tool helps you explore different scenarios, compare outcomes, and better understand how today’s decisions may affect future balances.\n\nUse this tool to:",
      "heroBullets": [
        "Explore long-term ABLE account growth under different assumptions",
        "Understand how contribution limits and eligibility rules may apply",
        "Model withdrawals alongside ongoing contributions",
        "Review projected balances, summaries, and charts across time"
      ],
      "agreeToTermsPrefix": "I agree to the",
      "termsOfUseLinkLabel": "Terms of Use",
      "agreeAndContinueLabel": "Agree and Continue",
      "termsOfUseTitle": "Terms of Use",
      "termsOfUseBody": "Spectra Professional Services, LLC. Terms of Use\nThese Terms of Use (\"Terms\") govern your access to and use of the ABLE Planning Tool (the \"Tool\") provided by Spectra Professional Services, LLC. (\"Company,\" \"we,\" \"us,\" or \"our\"). By accessing or using the Tool, you agree to be bound by these Terms. If you do not agree, you should not use the Tool.\n1. Informational and Educational Purposes Only\nThis Tool is provided solely for general informational and educational purposes. It is not intended to provide legal, tax, investment, or financial advice, and should not be relied upon as a substitute for advice from qualified professionals.\n2. No Guarantee of Results\nAll projections, charts, and reports generated by this Tool are hypothetical and based on user-provided assumptions. Actual results may differ materially. There is no guarantee that projected balances, investment returns, contribution eligibility, or tax benefits will be achieved.\n3. Risk of Loss\nYou may lose some or all of the money invested in an ABLE account.\n4. Investment Risk\nABLE accounts are subject to market risk, including the possible loss of principal. Investment returns are not guaranteed, and past performance is not indicative of future results. Changes in market conditions, fees, expenses, and investment selections may significantly affect outcomes. Market volatility, sequence-of-returns risk, and intra-year return variation are not simulated.\n5. Assumptions and Simplifications\nThis Tool relies on simplifying assumptions, including estimated rates of return, regular contribution and withdrawal schedules, and simplified treatment of taxes and tax benefits. Actual ABLE program rules, investment performance, and tax treatment vary by state and may change over time.\n\n6. Contribution Limits and Eligibility\nContribution limits, eligibility rules, federal and state benefits, and tax treatment are governed by federal and state law and individual ABLE program rules. This Tool does not determine eligibility or compliance and should not be used to make final contribution or withdrawal decisions.\n7. Withdrawals and Qualified Expenses\nWithdrawals must generally be used for qualified disability expenses to avoid adverse tax consequences. This Tool does not evaluate whether planned withdrawals qualify under applicable rules.\n8. Not an Offer or Recommendation\nNothing contained in this Tool constitutes an offer to sell, a solicitation of an offer to buy, or a recommendation regarding any investment, security, or financial product.\n9. Limitation of Liability\nTo the fullest extent permitted by law, Spectra Professional Services, LLC. shall not be liable for any indirect, incidental, special, consequential, exemplary, or punitive damages, or for any loss of profits, revenue, data, goodwill, or business opportunity arising out of or related to your use of the Tool, whether based in contract, tort (including negligence), strict liability, or otherwise, even if advised of the possibility of such damages.\nTotal liability, if any, shall not exceed the amount paid by you, if any, for access to the Tool.\n10. Indemnification\nYou agree to indemnify, defend, and hold harmless Spectra Professional Services, LLC., its officers, directors, employees, affiliates, and agents from and against any claims, liabilities, damages, losses, and expenses, including reasonable attorneys’ fees, arising out of or related to your use of the Tool or violation of these Terms.\n11. Governing Law\nThese Terms shall be governed by and construed in accordance with the laws of the State of New York and applicable federal laws of the United States, without regard to conflict of law principles. Any disputes shall be resolved in a court of competent jurisdiction.\n12. Use at Your Own Discretion\nBy using this Tool, you acknowledge that you are solely responsible for how you interpret and use the information provided. For guidance specific to your situation, you should consult a qualified financial, tax, or legal professional, or your state’s ABLE program administrator.\n13. Contact Information\nIf you have questions about these Terms, please contact Spectra Professional Services, LLC. at: ableplannertool@spectraps.com\n14. Accessibility Commitment\nSpectra Professional Services, LLC is committed to making the Tool accessible to individuals with disabilities and strives to conform to generally recognized accessibility standards, including the Web Content Accessibility Guidelines (WCAG) where applicable. If you experience difficulty accessing any portion of the Tool, please contact us so we may provide reasonable accommodations or alternative access.\n15. Copyrights, Trademarks, and Ownership\nAll content, software, calculations, designs, graphics, text, reports, projections, and other materials made available through the Tool (collectively, “Content”) are owned by Spectra Professional Services, LLC. or its licensors and are protected by United States and international intellectual property laws.\nThe names, logos, product names, service names, designs, and visual elements associated with the Tool (collectively, “Marks”) are trademarks, service marks, or trade dress of Spectra Professional Services, LLC. or its licensors. Unauthorized use of any Marks is strictly prohibited.\nYour use of the Tool does not grant you any ownership interest in the Content or Marks. No right, title, or interest in any Content is transferred to you.\nYou may use the Tool and its Content solely for your personal, non-commercial use in connection with evaluating ABLE account planning scenarios. Except as expressly permitted in these Terms, you may not copy, reproduce, distribute, republish, upload, post, transmit, modify, create derivative works from, sell, license, commercially exploit, remove proprietary notices, reverse engineer, decompile, disassemble, or attempt to extract the underlying source code of the Tool.\nAny unauthorized use of the Content or Marks may violate intellectual property laws and may result in legal action.\n16. External Links\nThe Tool may contain links to third-party websites or resources for your convenience. Spectra Professional Services, LLC. does not control, operate, or endorse any third-party websites, products, or services, and is not responsible for their content, accuracy, availability, or practices.\nAccessing any third-party website is at your own risk and subject to the terms and policies of those websites.\nYou may not create or maintain a link to the Tool from another website without our prior written consent. Framing, embedding, mirroring, or otherwise displaying any portion of the Tool on another website without prior written permission is prohibited.\nAny linking that is permitted must comply with all applicable laws and regulations. We reserve the right to revoke linking permission at any time in our sole discretion.\n17. Disclaimer of Warranties\nTHE TOOL IS PROVIDED “AS IS” AND “AS AVAILABLE” WITHOUT WARRANTIES OF ANY KIND, WHETHER EXPRESS, IMPLIED, OR STATUTORY.\nTO THE FULLEST EXTENT PERMITTED BY LAW, SPECTRA PROFESSIONAL SERVICES, LLC. DISCLAIMS ALL WARRANTIES, INCLUDING BUT NOT LIMITED TO IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT.\nWE DO NOT WARRANT THAT THE TOOL WILL BE UNINTERRUPTED, ERROR-FREE, SECURE, OR FREE FROM VIRUSES OR OTHER HARMFUL COMPONENTS, OR THAT ANY DEFECTS WILL BE CORRECTED.\nYOUR USE OF THE TOOL IS AT YOUR SOLE RISK.\n18. Severability\nIf any provision of these Terms is found to be invalid, illegal, or unenforceable under applicable law, the remaining provisions shall remain in full force and effect. Any invalid or unenforceable provision shall be interpreted to the fullest extent permitted by law to reflect the original intent of the parties.\n19. Entire Agreement\nThese Terms constitute the entire agreement between you and Spectra Professional Services, LLC. regarding your use of the Tool and supersede all prior or contemporaneous understandings, agreements, representations, and communications, whether written or oral, relating to the Tool.\n20. Modifications to These Terms\nSpectra Professional Services, LLC. reserves the right to modify or update these Terms at any time. Updated Terms will be effective upon posting within the Tool or on any associated website. Your continued use of the Tool after such changes constitutes your acceptance of the revised Terms.\n\n\n21. Waiver\nNo failure or delay by Spectra Professional Services, LLC. in exercising any right under these Terms shall constitute a waiver of that right. Any waiver must be in writing and signed by an authorized representative of Spectra Professional Services, LLC.\nElectronic Acceptance\nBy clicking the button labeled “Agree and Continue” you acknowledge that you have read, understood, and agree to be legally bound by these Terms of Use. If you do not agree to these Terms, you must not click the button and may not use the Tool.\nYour electronic acceptance of these Terms constitutes a legally binding agreement equivalent to a handwritten signature."
    },
    "es": {
      "heroTitle": "Bienvenido al Planificador ABLE de Illinois",
      "heroBody": "Una cuenta ABLE puede ser una herramienta potente para ahorrar, invertir y pagar gastos relacionados con la discapacidad sin poner en riesgo beneficios públicos esenciales. Esta herramienta de planificación le ayuda a explorar distintos escenarios, comparar resultados y comprender mejor cómo las decisiones de hoy pueden afectar los saldos del futuro. Explore cómo las contribuciones, los retiros, el crecimiento de las inversiones y los límites del programa pueden interactuar con el tiempo.",
      "heroBullets": [
        "Explorar el crecimiento a largo plazo de ABLE con distintos supuestos",
        "Entender límites de contribución y reglas de elegibilidad",
        "Modelar retiros junto con contribuciones",
        "Revisar saldos proyectados, resúmenes y gráficos en el tiempo"
      ],
      "agreeToTermsPrefix": "Acepto los",
      "termsOfUseLinkLabel": "Términos de uso",
      "agreeAndContinueLabel": "Aceptar y continuar",
      "termsOfUseTitle": "Términos de uso",
      "termsOfUseBody": "Términos de Uso de Spectra Professional Services, LLC.\nEstos Términos de Uso (\"Términos\") rigen su acceso y uso de la Herramienta de Planificación ABLE (la \"Herramienta\") proporcionada por Spectra Professional Services, LLC. (\"Compañía\", \"nosotros\" o \"nuestro\"). Al acceder o usar la Herramienta, usted acepta quedar obligado por estos Términos. Si no está de acuerdo, no debe usar la Herramienta.\n1. Solo para fines informativos y educativos\nEsta Herramienta se proporciona únicamente con fines informativos y educativos generales. No tiene la intención de proporcionar asesoría legal, fiscal, de inversión ni financiera, y no debe considerarse un sustituto de la asesoría de profesionales calificados.\n2. Sin garantía de resultados\nTodas las proyecciones, gráficos e informes generados por esta Herramienta son hipotéticos y se basan en supuestos proporcionados por el usuario. Los resultados reales pueden diferir de manera significativa. No existe garantía de que se logren saldos proyectados, rendimientos de inversión, elegibilidad de contribución o beneficios fiscales.\n3. Riesgo de pérdida\nUsted puede perder parte o la totalidad del dinero invertido en una cuenta ABLE.\n4. Riesgo de inversión\nLas cuentas ABLE están sujetas al riesgo de mercado, incluida la posible pérdida del principal. Los rendimientos de inversión no están garantizados y el desempeño pasado no indica resultados futuros. Los cambios en condiciones de mercado, tarifas, gastos y selecciones de inversión pueden afectar significativamente los resultados. No se simulan la volatilidad del mercado, el riesgo de secuencia de rendimientos ni la variación intranual de rendimientos.\n5. Supuestos y simplificaciones\nEsta Herramienta se basa en supuestos simplificados, incluidas tasas de rendimiento estimadas, cronogramas regulares de contribuciones y retiros, y un tratamiento simplificado de impuestos y beneficios fiscales. Las reglas reales de los programas ABLE, el desempeño de inversión y el tratamiento fiscal varían por estado y pueden cambiar con el tiempo.\n\n6. Límites de contribución y elegibilidad\nLos límites de contribución, las reglas de elegibilidad, los beneficios federales y estatales, y el tratamiento fiscal se rigen por leyes federales y estatales y por las reglas de cada programa ABLE. Esta Herramienta no determina elegibilidad ni cumplimiento y no debe utilizarse para tomar decisiones finales de contribución o retiro.\n7. Retiros y gastos calificados\nPor lo general, los retiros deben utilizarse para gastos calificados relacionados con la discapacidad para evitar consecuencias fiscales adversas. Esta Herramienta no evalúa si los retiros planificados califican conforme a las reglas aplicables.\n8. No constituye oferta ni recomendación\nNada de lo contenido en esta Herramienta constituye una oferta de venta, una solicitud de oferta de compra, ni una recomendación respecto de ninguna inversión, valor o producto financiero.\n9. Limitación de responsabilidad\nEn la máxima medida permitida por la ley, Spectra Professional Services, LLC. no será responsable por daños indirectos, incidentales, especiales, consecuentes, ejemplares o punitivos, ni por pérdida de ganancias, ingresos, datos, reputación comercial u oportunidades de negocio que surjan de o estén relacionados con su uso de la Herramienta, ya sea por contrato, agravio (incluida negligencia), responsabilidad estricta u otra teoría, incluso si se advirtió sobre la posibilidad de dichos daños.\nLa responsabilidad total, si existiera, no excederá el monto pagado por usted, si lo hubiera, por el acceso a la Herramienta.\n10. Indemnización\nUsted acepta indemnizar, defender y mantener indemne a Spectra Professional Services, LLC., sus directivos, directores, empleados, afiliadas y agentes frente a cualquier reclamo, responsabilidad, daño, pérdida y gasto, incluidos honorarios razonables de abogados, que surjan de o estén relacionados con su uso de la Herramienta o con la violación de estos Términos.\n11. Ley aplicable\nEstos Términos se regirán e interpretarán de conformidad con las leyes del Estado de Nueva York y las leyes federales aplicables de los Estados Unidos, sin considerar principios de conflicto de leyes. Cualquier disputa se resolverá en un tribunal con jurisdicción competente.\n12. Uso bajo su propio criterio\nAl usar esta Herramienta, usted reconoce que es el único responsable de cómo interpreta y usa la información proporcionada. Para orientación específica a su situación, debe consultar a un profesional calificado en materia financiera, fiscal o legal, o al administrador del programa ABLE de su estado.\n13. Información de contacto\nSi tiene preguntas sobre estos Términos, comuníquese con Spectra Professional Services, LLC. en: ableplannertool@spectraps.com\n14. Compromiso de accesibilidad\nSpectra Professional Services, LLC está comprometida con hacer la Herramienta accesible para personas con discapacidad y procura cumplir con estándares de accesibilidad generalmente reconocidos, incluidas las Pautas de Accesibilidad para el Contenido Web (WCAG), cuando corresponda. Si tiene dificultades para acceder a cualquier parte de la Herramienta, comuníquese con nosotros para que podamos ofrecer adaptaciones razonables o acceso alternativo.\n15. Derechos de autor, marcas y propiedad\nTodo el contenido, software, cálculos, diseños, gráficos, texto, informes, proyecciones y otros materiales disponibles a través de la Herramienta (en conjunto, el \"Contenido\") son propiedad de Spectra Professional Services, LLC. o de sus licenciantes y están protegidos por leyes de propiedad intelectual de los Estados Unidos e internacionales.\nLos nombres, logotipos, nombres de productos, nombres de servicios, diseños y elementos visuales asociados con la Herramienta (en conjunto, las \"Marcas\") son marcas comerciales, marcas de servicio o imagen comercial de Spectra Professional Services, LLC. o sus licenciantes. El uso no autorizado de cualquier Marca está estrictamente prohibido.\nSu uso de la Herramienta no le concede ningún derecho de propiedad sobre el Contenido o las Marcas. No se le transfiere ningún derecho, título o interés sobre ningún Contenido.\nPuede usar la Herramienta y su Contenido únicamente para su uso personal y no comercial en relación con la evaluación de escenarios de planificación de cuentas ABLE. Salvo lo expresamente permitido en estos Términos, no puede copiar, reproducir, distribuir, republicar, cargar, publicar, transmitir, modificar, crear obras derivadas, vender, licenciar, explotar comercialmente, eliminar avisos de propiedad, realizar ingeniería inversa, descompilar, desensamblar ni intentar extraer el código fuente subyacente de la Herramienta.\nCualquier uso no autorizado del Contenido o de las Marcas puede violar leyes de propiedad intelectual y puede dar lugar a acciones legales.\n16. Enlaces externos\nLa Herramienta puede contener enlaces a sitios web o recursos de terceros para su conveniencia. Spectra Professional Services, LLC. no controla, opera ni respalda sitios web, productos o servicios de terceros, y no es responsable de su contenido, exactitud, disponibilidad o prácticas.\nEl acceso a cualquier sitio web de terceros es bajo su propio riesgo y está sujeto a los términos y políticas de esos sitios.\nNo puede crear ni mantener un enlace a la Herramienta desde otro sitio web sin nuestro consentimiento previo por escrito. Está prohibido enmarcar, incrustar, reflejar o mostrar de cualquier otra forma cualquier parte de la Herramienta en otro sitio web sin autorización previa por escrito.\nCualquier enlace permitido debe cumplir con todas las leyes y regulaciones aplicables. Nos reservamos el derecho de revocar el permiso de enlace en cualquier momento y a nuestra sola discreción.\n17. Exclusión de garantías\nLA HERRAMIENTA SE PROPORCIONA \"TAL CUAL\" Y \"SEGÚN DISPONIBILIDAD\", SIN GARANTÍAS DE NINGÚN TIPO, YA SEAN EXPRESAS, IMPLÍCITAS O LEGALES.\nEN LA MÁXIMA MEDIDA PERMITIDA POR LA LEY, SPECTRA PROFESSIONAL SERVICES, LLC. RENUNCIA A TODAS LAS GARANTÍAS, INCLUIDAS, ENTRE OTRAS, LAS GARANTÍAS IMPLÍCITAS DE COMERCIABILIDAD, IDONEIDAD PARA UN PROPÓSITO PARTICULAR, TÍTULO Y NO INFRACCIÓN.\nNO GARANTIZAMOS QUE LA HERRAMIENTA FUNCIONE DE FORMA ININTERRUMPIDA, LIBRE DE ERRORES, SEGURA O LIBRE DE VIRUS U OTROS COMPONENTES DAÑINOS, NI QUE CUALQUIER DEFECTO SEA CORREGIDO.\nEL USO DE LA HERRAMIENTA ES BAJO SU PROPIO RIESGO.\n18. Divisibilidad\nSi alguna disposición de estos Términos se considera inválida, ilegal o inaplicable conforme a la ley aplicable, las disposiciones restantes permanecerán en pleno vigor y efecto. Cualquier disposición inválida o inaplicable se interpretará en la máxima medida permitida por la ley para reflejar la intención original de las partes.\n19. Acuerdo completo\nEstos Términos constituyen el acuerdo completo entre usted y Spectra Professional Services, LLC. respecto de su uso de la Herramienta y sustituyen todos los entendimientos, acuerdos, declaraciones y comunicaciones anteriores o contemporáneos, ya sean escritos u orales, relacionados con la Herramienta.\n20. Modificaciones de estos Términos\nSpectra Professional Services, LLC. se reserva el derecho de modificar o actualizar estos Términos en cualquier momento. Los Términos actualizados serán efectivos al publicarse dentro de la Herramienta o en cualquier sitio web asociado. Su uso continuado de la Herramienta después de dichos cambios constituye su aceptación de los Términos revisados.\n\n\n21. Renuncia\nNinguna falta o demora de Spectra Professional Services, LLC. en el ejercicio de cualquier derecho bajo estos Términos constituirá una renuncia a ese derecho. Toda renuncia debe constar por escrito y estar firmada por un representante autorizado de Spectra Professional Services, LLC.\nAceptación electrónica\nAl hacer clic en el botón \"Aceptar y continuar\", usted reconoce que ha leído, entendido y acepta quedar legalmente obligado por estos Términos de Uso. Si no está de acuerdo con estos Términos, no debe hacer clic en el botón y no puede usar la Herramienta.\nSu aceptación electrónica de estos Términos constituye un acuerdo legalmente vinculante equivalente a una firma manuscrita."
    }
  }
}
